Classes | Public Member Functions | Static Public Member Functions | Friends | List of all members
ACAPI::MEP::PhysicalSystem Class Referencefinal
MEP Element Manager
A PhysicalSystem represents a physical instance of a system. More...
#include <MEPPhysicalSystem.hpp>
 Inheritance diagram for ACAPI::MEP::PhysicalSystem:
 Classes
class  | Modifier
Modifier object for PhysicalSystem. More...
 Public Member Functions
Result< void >  | IsEditable () const
Checks whether the PhysicalSystem is editable.
std::optional< UniqueID >  | GetRootElementId () const
Get the currently assigned root element ID.
GS::UniString  | GetName () const
Get the name of the PhysicalSystem.
API_AttributeIndex  | GetSystemCategory () const
Get the system category of the PhysicalSystem.
template<std::invocable< PhysicalSystem::Modifier & > ModifierFunc>
Result< void >  | Modify (ModifierFunc &&modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< PhysicalSystem >  | Get (const UniqueID &uniqueId)
Fetch a PhysicalSystem.
static Result< PhysicalSystem >  | Create (const GS::UniString &name, const UniqueID &groupId)
Creates a new PhysicalSystem.
static Result< std::vector< std::vector< UniqueID > > >  | FindSystemIdsFromElementIds (const std::vector< UniqueID > &elementIds, const ACAPI::MEP::DistributionSystemsGraph *distributionGraph)
Find PhysicalSystems by a list of unique identifiers of elements in the system.
 Friends
 class  | ACAPI::Impl::ObjectCreator
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A PhysicalSystem represents a physical instance of a system.
Where a DistributionSystem represents a logical grouping of connected elements, a PhysicalSystem represents a physical one. A PhysicalSystem only specifies certain instance specific attributes about a system like its name, "root" / "calculation starting point" and domain, but does not track the elements contained in the system.
Given that the PhysicalSystem has an assosiated "root" element, the PhysicalSystem can be represented by a DistributionSystem, and the elements currently contained by the PhysicalSystem can be queried for via its DistributionSystem.
Contrary to a DistributionSystem, a PhysicalSystem is a database object and will be serialized to a pln file.
See also
SystemGroup
Since
Archicad 29
Member Function Documentation
◆ Create()
 static Result< PhysicalSystem > ACAPI::MEP::PhysicalSystem::Create  |  ( |  const GS::UniString & |  name,
|  const UniqueID & |  groupId )
static
Creates a new PhysicalSystem.
Parameters
name | The name of the new PhysicalSystem.
groupId | The unique identifier of the owning SystemGroup object.
Remarks
Creating a new PhysicalSystem in a teamwork project requires the owning SystemGroup to be reserved for the current user. This function is simply an alternative to invoking SystemGroup::Modifier::Add.
Returns
Returns the newly created PhysicalSystem if successful, otherwise an error.
◆ FindSystemIdsFromElementIds()
 static Result< std::vector< std::vector< UniqueID > > > ACAPI::MEP::PhysicalSystem::FindSystemIdsFromElementIds  |  ( |  const std::vector< UniqueID > & |  elementIds,
|  const ACAPI::MEP::DistributionSystemsGraph * |  distributionGraph )
static
Find PhysicalSystems by a list of unique identifiers of elements in the system.
Parameters
elementIds | A list of unique identifiers of an element objects present in PhysicalSystems.
distributionGraph | The current distributionGraph if available, otherwise nullptr. In which case the function will calculate it. Should be supplied for better overall performance.
This function is useful when the user has unique identifiers of elements and wants to find all PhysicalSystems they belong to. e.g. if the user has an element selected in the UI and wants to find the PhysicalSystems it belongs to.
Returns
If the element ids given are present in one or more PhysicalSystems those PhysicalSystem objects will be returned or an empty list will be returned. Each elementId will have a corresponding list of PhysicalSystem objects in the returned vector.
◆ Get()
 static Result< PhysicalSystem > ACAPI::MEP::PhysicalSystem::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Fetch a PhysicalSystem.
Parameters
uniqueId | The unique identifier of the PhysicalSystem object
Returns
If the uniqueId refers to a PhysicalSystem, returns the associated object, otherwise an error.
 const ACAPI::Result<ACAPI::MEP::PhysicalSystem> system { ACAPI::MEP::PhysicalSystem::Get (systemID) };
 if (system.IsErr ())
 return system.UnwrapErr ().kind;
◆ GetName()
 GS::UniString ACAPI::MEP::PhysicalSystem::GetName  |  ( |   | ) |   const
Get the name of the PhysicalSystem.
Returns
The name of the PhysicalSystem
 GS::UniString labelContent { GS::UniString::SPrintf ("Group: %T, System: %T", systemGroup->GetName (), system->GetName ()) };
 const GS::GSErrCode err { CreateLabelOnElement (element.Unwrap (), std::move (labelContent)) };
 if (err != NoError)
 return err;
// ! [SystemGroup-GetName-Example]
◆ GetRootElementId()
 std::optional< UniqueID > ACAPI::MEP::PhysicalSystem::GetRootElementId  |  ( |   | ) |   const
Get the currently assigned root element ID.
Returns
If the PhysicalSystem has a root element assigned, returns the UniqueID of the root element, otherwise std::nullopt
 const std::optional<ACAPI::MEP::UniqueID> rootElementId = system.Unwrap ().GetRootElementId ();
 if (!rootElementId.has_value ())
 continue;
 const ACAPI::Result<ACAPI::MEP::Element> element { ACAPI::MEP::Element::Get (rootElementId.value ()) };
 if (element.IsErr ())
 return element.UnwrapErr ().kind;
◆ GetSystemCategory()
 API_AttributeIndex ACAPI::MEP::PhysicalSystem::GetSystemCategory  |  ( |   | ) |   const
Get the system category of the PhysicalSystem.
Returns
The attribute index of the system category of the PhysicalSystem
◆ IsEditable()
 Result< void > ACAPI::MEP::PhysicalSystem::IsEditable  |  ( |   | ) |   const
Checks whether the PhysicalSystem is editable.
Returns
Returns nothing if the PhysicalSystem is editable, otherwise the error code and error message containing information about the reason.
◆ Modify()
 template<std::invocable< PhysicalSystem::Modifier & > ModifierFunc>
 Result< void > ACAPI::MEP::PhysicalSystem::Modify  |  ( |  ModifierFunc && |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function, function pointer or similar) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
 auto system { ACAPI::MEP::PhysicalSystem::Get (*createdId) };
 if (system.IsErr ())
 return {};
 if (system->Modify ([&](ACAPI::MEP::PhysicalSystem::Modifier& modifier) -> GS::GSErrCode {
 RETURN_IF_RESULT_ERROR (modifier.SetSystemCategory (systemCategoryIndex));
 RETURN_IF_RESULT_ERROR (modifier.SetRootElement (rootElement));
 return NoError;
 }, "Set data of newly created system").IsErr ())
 return {};